Tekla.Structures.Drawing.DrawingObject
The DrawingObject class is an abstract base class for all the objects in the drawing.
All drawing objects have a database identifier and belong to some view.

Tekla.Structures.Drawing.DrawingObject.SelectCorrectInstance``1(Tekla.Structures.Identifier,Tekla.Structures.Identifier)
Selects the correct instance.
The type.
id: The identifier.
drawingIdentifier: The drawing identifier.
Returns: An instance of type derived from Tekla.Structures.Drawing.DrawingObject.

Tekla.Structures.Drawing.DrawingObject.GetCorrectInstance(Tekla.Structures.Identifier,Tekla.Structures.Identifier)
Gets the correct instance.
id: The identifier.
drawingIdentifier: The drawing identifier.
Returns: An instance of Tekla.Structures.Drawing.DrawingObject.

Tekla.Structures.Drawing.DrawingObject.GetDrawingObject(Tekla.Structures.Identifier,Tekla.Structures.Identifier)
Gets the drawing object.
ID: The identifier.
DrawingIdentifier: The drawing identifier.
Returns: An instance of Tekla.Structures.Drawing.DrawingObject.

Tekla.Structures.Drawing.DrawingObject.GetCorrectInstance(Tekla.Structures.Identifier,Tekla.Structures.Identifier,Tekla.Structures.Drawing.DrawingObject.ObjectTypes)
Gets the correct instance.
id: The identifier.
drawingIdentifier: The drawing identifier.
Type: The type.
Returns: The correct instance of type Tekla.Structures.Drawing.DrawingObject.
Throws System.NotImplementedException: Report Templates have not been implemented yet.
Throws System.ApplicationException: Unsupported type! " + Type

Tekla.Structures.Drawing.DrawingObject.SetView(Tekla.Structures.Drawing.ViewBase)
Set view to which the drawing object belongs
view: The view.
Returns: True if setting of view succeeds.

Tekla.Structures.Drawing.DrawingObject.GetTypeOfObjectTypes
Gets the type of object types.
Returns: Instance of Tekla.Structures.Drawing.DrawingObject.Type.

Tekla.Structures.Drawing.DrawingObject.GetRelatedObjects
Gets the related objects of the current object.
Returns: The related objects of the current object.

Tekla.Structures.Drawing.DrawingObject.GetRelatedObjects(System.Type[])
Gets the related objects of the current object that are of certain types.
typeFilter: The types of the objects to get.
Returns: The related objects of the current object that are of certain types.

Tekla.Structures.Drawing.DrawingObject._Attributes


Tekla.Structures.Drawing.DrawingObject.Attributes
Gets or sets the attributes of the current object.
Only attributes of the same type as the object are allowed.

Tekla.Structures.Drawing.DrawingObject.View
Gets or sets the view.

Tekla.Structures.Drawing.DrawingObject.Type
Type of the object

Tekla.Structures.Drawing.DrawingObject.GetView
Gets the view where the drawing object is.
Returns: The view where the drawing object is.

Tekla.Structures.Drawing.DrawingObject.GetDrawing
Gets the drawing where the drawing object is.
Returns: The drawing where the drawing object is.

Tekla.Structures.Drawing.DrawingObject.GetSheet(Tekla.Structures.Identifier)
Gets the sheet.
DrawingIdentifier: The drawing identifier.
Returns: The sheet.

Tekla.Structures.Drawing.DrawingObject.#ctor
Initializes a new instance of the Tekla.Structures.Drawing.DrawingObject class.

Tekla.Structures.Drawing.DrawingObject.GetMaxPropertyValueStringLength


Tekla.Structures.Drawing.DrawingObject.QueryUserPropertySet(Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)


Tekla.Structures.Drawing.DrawingObject.QueryUserPropertyGet(Tekla.Structures.DrawingInternal.dotGrUserProperty_t@)


Tekla.Structures.Drawing.DrawingObject.ToString
Changes the string presentation of the drawing object.
Returns: The name of the current drawing object.

Tekla.Structures.Drawing.DrawingObject.IsEqual(System.Object)
Compares the current object with the given object.
Checks every field of both objects for equality.
ObjectToCompare: An object of the same type to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.